experiments/results/minperf_kda_s96_20260822/cal_kda_padded_N40_w16_ckpt96_recon0.log
[launch] backend=kda mode=padded N=40 distinct=184 ckpt=96 wmax=16 ragged=0 reqs=184 -> /home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/server_kda_padded_N40_w16_ckpt96_recon0.log
[wait] server pid=4031814 warming up...
[ready] after 70s
[capacity] backend=kda mode=padded cap=1.69x bytes/slot=12456960 slots=96 ckpt_HBM=1140.5MB (avg of 2 TP ranks) ([2026-08-22 12:44:43 TP0] head-aware mamba checkpoint pool (route A): plan built, bytes/slot=12984320 vs dense 20971520 (1.62x capacity); 1.24GB over 96 slots)
[flush]
[warm] backend=kda mode=padded
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31007/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 234443
#Output tokens: 11776
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 184/184 [00:12<00:00, 14.52it/s]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang
Traffic request rate:                    inf
Max request concurrency:                 16
Successful requests:                     184
Benchmark duration (s):                  12.68
Total input tokens:                      234443
Total input text tokens:                 234443
Total generated tokens:                  11776
Total generated tokens (retokenized):    11299
Request throughput (req/s):              14.51
Input token throughput (tok/s):          18482.53
Output token throughput (tok/s):         928.37
Peak output token throughput (tok/s):    1027.00
Peak concurrent requests:                32
Total token throughput (tok/s):          19410.90
Concurrency:                             15.52
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1070.19
Median E2E Latency (ms):                 1090.85
P90 E2E Latency (ms):                    1205.00
P95 E2E Latency (ms):                    1333.16
P99 E2E Latency (ms):                    1334.32
---------------Time to First Token----------------
Mean TTFT (ms):                          338.24
Median TTFT (ms):                        331.91
P90 TTFT (ms):                           512.62
P95 TTFT (ms):                           595.20
P99 TTFT (ms):                           795.77
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.62
Median TPOT (ms):                        11.19
P90 TPOT (ms):                           15.02
P95 TPOT (ms):                           16.04
P99 TPOT (ms):                           17.67
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.62
Median ITL (ms):                         8.15
P90 ITL (ms):                            8.49
P95 ITL (ms):                            8.75
P99 ITL (ms):                            154.37
Max ITL (ms):                            703.79
==================================================
[measure] backend=kda mode=padded seed=42
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_padded_N40_w16_ckpt96_recon0_seed42.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31007/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_padded_N40_w16_ckpt96_recon0_seed42.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 234443
#Output tokens: 11776
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 184/184 [00:11<00:00, 15.70it/s]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang
Traffic request rate:                    inf
Max request concurrency:                 16
Successful requests:                     184
Benchmark duration (s):                  11.73
Total input tokens:                      234443
Total input text tokens:                 234443
Total generated tokens:                  11776
Total generated tokens (retokenized):    11305
Request throughput (req/s):              15.69
Input token throughput (tok/s):          19988.74
Output token throughput (tok/s):         1004.03
Peak output token throughput (tok/s):    1100.00
Peak concurrent requests:                48
Total token throughput (tok/s):          20992.77
Concurrency:                             15.45
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   984.99
Median E2E Latency (ms):                 1002.14
P90 E2E Latency (ms):                    1037.51
P95 E2E Latency (ms):                    1108.21
P99 E2E Latency (ms):                    1109.03
---------------Time to First Token----------------
Mean TTFT (ms):                          284.57
Median TTFT (ms):                        256.72
P90 TTFT (ms):                           424.71
P95 TTFT (ms):                           495.99
P99 TTFT (ms):                           499.14
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.12
Median TPOT (ms):                        11.00
P90 TPOT (ms):                           13.70
P95 TPOT (ms):                           13.91
P99 TPOT (ms):                           15.10
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.12
Median ITL (ms):                         8.15
P90 ITL (ms):                            8.47
P95 ITL (ms):                            8.69
P99 ITL (ms):                            156.93
Max ITL (ms):                            506.96
==================================================
[hit] backend=kda mode=padded seed=42 cached=137603 new=97867 token_hit_rate=0.5844
[result] kda/padded N40 seed=42: hit=0.5844 ttft_mean=284.6 p50=256.7 p95=496.0 p99=499.1 thr=1004.0 e2e=985.0 in_tok=234443 ckpt=96 HBM=1140.5MB cap=1.69x peak=NA recon_hits=NA replay_mean=NA
[done] backend=kda mode=padded (seeds=42) -> /home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_padded_N40_w16_ckpt96_recon0_seed*.json